In [100]:
import pandas as pd

print(f"{pd.__version__}")

1.5.3

# **Creating a DataFrame From a Dictionary**

In [101]:
forum_users = {

    'User_ID' : [1, 2, 3, 4, 5],
    'Username' : ['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age' : [18, 35, 25, 38, 45],
    'Joined_Date': ['2032-01-01', '2032-02-15', '2032-04-25', '2032-06-21', '2032-09-15'],
    'Total_Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 650]
}

df = pd.DataFrame(forum_users)
df

   User_ID     Username  Age Joined_Date  Total_Posts  Reputation
0        1     bogdan_s   18  2032-01-01          150         500
1        2   jane_smith   35  2032-02-15          230         720
2        3      alex123   25  2032-04-25           80         200
3        4        bob56   38  2032-06-21          420         940
4        5  mark_wilson   45  2032-09-15          310         650

# **Basic Operations With DataFrame**

In [102]:
df.shape

(5, 6)

In [103]:
type(df)

pandas.core.frame.DataFrame

In [104]:
df.columns

Index(['User_ID', 'Username', 'Age', 'Joined_Date', 'Total_Posts',
       'Reputation'],
      dtype='object')

In [105]:
df.columns.tolist()

['User_ID', 'Username', 'Age', 'Joined_Date', 'Total_Posts', 'Reputation']

In [106]:
df.dtypes

User_ID         int64
Username       object
Age             int64
Joined_Date    object
Total_Posts     int64
Reputation      int64
dtype: object

In [107]:
df.values

array([[1, 'bogdan_s', 18, '2032-01-01', 150, 500],
       [2, 'jane_smith', 35, '2032-02-15', 230, 720],
       [3, 'alex123', 25, '2032-04-25', 80, 200],
       [4, 'bob56', 38, '2032-06-21', 420, 940],
       [5, 'mark_wilson', 45, '2032-09-15', 310, 650]], dtype=object)

In [108]:
type(df.values)

numpy.ndarray

In [109]:
df.values[1, 1]

'jane_smith'

In [110]:
df.head(3)

   User_ID    Username  Age Joined_Date  Total_Posts  Reputation
0        1    bogdan_s   18  2032-01-01          150         500
1        2  jane_smith   35  2032-02-15          230         720
2        3     alex123   25  2032-04-25           80         200

In [111]:
df.tail(2)

   User_ID     Username  Age Joined_Date  Total_Posts  Reputation
3        4        bob56   38  2032-06-21          420         940
4        5  mark_wilson   45  2032-09-15          310         650

# **Describing The DataFrame**

In [112]:
df.describe()

        User_ID        Age  Total_Posts  Reputation
count  5.000000   5.000000     5.000000    5.000000
mean   3.000000  32.200000   238.000000  602.000000
std    1.581139  10.709809   133.304163  274.990909
min    1.000000  18.000000    80.000000  200.000000
25%    2.000000  25.000000   150.000000  500.000000
50%    3.000000  35.000000   230.000000  650.000000
75%    4.000000  38.000000   310.000000  720.000000
max    5.000000  45.000000   420.000000  940.000000

# **Finding Null Values In The DataFrame**

In [113]:
forum_users = {

    'User_ID' : [1, 2, 3, 4, 5],
    'Username' : ['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age' : [18, 35, 25, 38, None],
    'Joined_Date': ['2032-01-01', '2032-02-15', '2032-04-25', '2032-06-21', '2032-09-15'],
    'Total_Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 650]
}

df = pd.DataFrame(forum_users)
df

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation
0        1     bogdan_s  18.0  2032-01-01          150         500
1        2   jane_smith  35.0  2032-02-15          230         720
2        3      alex123  25.0  2032-04-25           80         200
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         650

In [114]:
type(df.isna())

pandas.core.frame.DataFrame

In [115]:
df.isna()

   User_ID  Username    Age  Joined_Date  Total_Posts  Reputation
0    False     False  False        False        False       False
1    False     False  False        False        False       False
2    False     False  False        False        False       False
3    False     False  False        False        False       False
4    False     False   True        False        False       False

In [116]:
df.isna().sum()

User_ID        0
Username       0
Age            1
Joined_Date    0
Total_Posts    0
Reputation     0
dtype: int64

# **Finding Columns With Specific Data Type**

In [117]:
df.select_dtypes(include='object')

      Username Joined_Date
0     bogdan_s  2032-01-01
1   jane_smith  2032-02-15
2      alex123  2032-04-25
3        bob56  2032-06-21
4  mark_wilson  2032-09-15

In [118]:
df.select_dtypes(include='object').columns

Index(['Username', 'Joined_Date'], dtype='object')

In [119]:
df.select_dtypes(include='int64').columns

Index(['User_ID', 'Total_Posts', 'Reputation'], dtype='object')

In [120]:
df.select_dtypes(exclude='float64').columns

Index(['User_ID', 'Username', 'Joined_Date', 'Total_Posts', 'Reputation'], dtype='object')

# **Series Data Structure In Pandas**

In [121]:
df['Username']

0       bogdan_s
1     jane_smith
2        alex123
3          bob56
4    mark_wilson
Name: Username, dtype: object

In [122]:
type(df.Username)

pandas.core.series.Series

In [123]:
forum_users = {

    'User_ID' : [1, 2, 3, 4, 5],
    'Username' : ['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age' : [18, 35, 25, 38, None],
    'Joined_Date': ['2032-01-01', '2032-02-15', '2032-04-25', '2032-06-21', '2032-09-15'],
    'Total_Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}


df = pd.DataFrame(forum_users)

In [124]:
df.Username.value_counts()

bogdan_s       1
jane_smith     1
alex123        1
bob56          1
mark_wilson    1
Name: Username, dtype: int64

In [125]:
df.Reputation.value_counts(ascending=True, normalize=True)

720    0.2
200    0.2
940    0.2
500    0.4
Name: Reputation, dtype: float64

In [126]:
df.Reputation.unique()

array([500, 720, 200, 940], dtype=int64)

In [127]:
type(df.Reputation.unique())

numpy.ndarray

In [128]:
df.Username.sort_values()

2        alex123
3          bob56
0       bogdan_s
1     jane_smith
4    mark_wilson
Name: Username, dtype: object

# **Selecting Part oF DataFrame Using loc and iloc Properties**

In [129]:
df[['Username', 'Age']]

      Username   Age
0     bogdan_s  18.0
1   jane_smith  35.0
2      alex123  25.0
3        bob56  38.0
4  mark_wilson   NaN

In [130]:
df.loc[2]

User_ID                 3
Username          alex123
Age                  25.0
Joined_Date    2032-04-25
Total_Posts            80
Reputation            200
Name: 2, dtype: object

In [131]:
df.loc[1:3]

   User_ID    Username   Age Joined_Date  Total_Posts  Reputation
1        2  jane_smith  35.0  2032-02-15          230         720
2        3     alex123  25.0  2032-04-25           80         200
3        4       bob56  38.0  2032-06-21          420         940

In [132]:
df.loc[2:3, ['Age', 'Total_Posts']]

    Age  Total_Posts
2  25.0           80
3  38.0          420

In [98]:
df.iloc[3]

User_ID                 4
Username            bob56
Age                  38.0
Joined_Date    2032-06-21
Total_Post            420
Reputation            940
Name: 3, dtype: object

In [133]:
df.iloc[2:4]

   User_ID Username   Age Joined_Date  Total_Posts  Reputation
2        3  alex123  25.0  2032-04-25           80         200
3        4    bob56  38.0  2032-06-21          420         940

In [136]:
df.iloc[:, 1:4]

      Username   Age Joined_Date
0     bogdan_s  18.0  2032-01-01
1   jane_smith  35.0  2032-02-15
2      alex123  25.0  2032-04-25
3        bob56  38.0  2032-06-21
4  mark_wilson   NaN  2032-09-15

# **Filtering Data In The DataFrame**

In [137]:
df[df['Reputation'] == 500]

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation
0        1     bogdan_s  18.0  2032-01-01          150         500
4        5  mark_wilson   NaN  2032-09-15          310         500

In [138]:
df[df['Total_Posts'] >= 200]

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation
1        2   jane_smith  35.0  2032-02-15          230         720
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [140]:
df[(df['Total_Posts'] >= 200) & (df['Age'] >= 36)]

   User_ID Username   Age Joined_Date  Total_Posts  Reputation
3        4    bob56  38.0  2032-06-21          420         940

In [141]:
df[(df['Total_Posts'] >= 200) | (df['Age'] >= 36)]

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation
1        2   jane_smith  35.0  2032-02-15          230         720
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [142]:
df.isin([200, 500])

   User_ID  Username    Age  Joined_Date  Total_Posts  Reputation
0    False     False  False        False        False        True
1    False     False  False        False        False       False
2    False     False  False        False        False        True
3    False     False  False        False        False       False
4    False     False  False        False        False        True

In [143]:
df['Reputation'].isin([200, 500])

0     True
1    False
2     True
3    False
4     True
Name: Reputation, dtype: bool

In [144]:
df[df['Reputation'].isin([200, 500])]

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation
0        1     bogdan_s  18.0  2032-01-01          150         500
2        3      alex123  25.0  2032-04-25           80         200
4        5  mark_wilson   NaN  2032-09-15          310         500

In [145]:
df[df['Total_Posts'].isin(range(200, 350))]

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation
1        2   jane_smith  35.0  2032-02-15          230         720
4        5  mark_wilson   NaN  2032-09-15          310         500

# **Datetime Type In Pandas**

In [146]:
forum_users = {

    'User_ID' : [1, 2, 3, 4, 5],
    'Username' : ['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age' : [18, 35, 25, 38, None],
    'Joined_Date': pd.to_datetime(['2032-01-01', '2032-02-15', '2032-04-25', '2032-06-21', '2032-09-15']),
    'Total_Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}


df = pd.DataFrame(forum_users)

In [147]:
df.dtypes

User_ID                 int64
Username               object
Age                   float64
Joined_Date    datetime64[ns]
Total_Posts             int64
Reputation              int64
dtype: object

In [148]:
df.values

array([[1, 'bogdan_s', 18.0, Timestamp('2032-01-01 00:00:00'), 150, 500],
       [2, 'jane_smith', 35.0, Timestamp('2032-02-15 00:00:00'), 230,
        720],
       [3, 'alex123', 25.0, Timestamp('2032-04-25 00:00:00'), 80, 200],
       [4, 'bob56', 38.0, Timestamp('2032-06-21 00:00:00'), 420, 940],
       [5, 'mark_wilson', nan, Timestamp('2032-09-15 00:00:00'), 310,
        500]], dtype=object)

In [149]:
df.describe()

        User_ID        Age  Total_Posts  Reputation
count  5.000000   4.000000     5.000000    5.000000
mean   3.000000  29.000000   238.000000  572.000000
std    1.581139   9.201449   133.304163  276.622486
min    1.000000  18.000000    80.000000  200.000000
25%    2.000000  23.250000   150.000000  500.000000
50%    3.000000  30.000000   230.000000  500.000000
75%    4.000000  35.750000   310.000000  720.000000
max    5.000000  38.000000   420.000000  940.000000

In [150]:
date_range = pd.date_range(start='2032-03-01', end='2032-08-01')
df[df['Joined_Date'].isin(date_range)]

   User_ID Username   Age Joined_Date  Total_Posts  Reputation
2        3  alex123  25.0  2032-04-25           80         200
3        4    bob56  38.0  2032-06-21          420         940

# **Sorting Data in the DataFrame**

In [151]:
df.sort_values(by='Age', ascending=True)

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation
0        1     bogdan_s  18.0  2032-01-01          150         500
2        3      alex123  25.0  2032-04-25           80         200
1        2   jane_smith  35.0  2032-02-15          230         720
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [153]:
df.sort_values(by='Joined_Date', ascending=False)

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation
4        5  mark_wilson   NaN  2032-09-15          310         500
3        4        bob56  38.0  2032-06-21          420         940
2        3      alex123  25.0  2032-04-25           80         200
1        2   jane_smith  35.0  2032-02-15          230         720
0        1     bogdan_s  18.0  2032-01-01          150         500

In [154]:
df[['User_ID', 'Total_Posts', 'Reputation']].sort_values(by=2, axis=1, ascending=False)

   Reputation  Total_Posts  User_ID
0         500          150        1
1         720          230        2
2         200           80        3
3         940          420        4
4         500          310        5

# **Adding and Removing Columns And Concatenating DataFrames**

In [155]:
df['Language'] = 'French'
df

   User_ID     Username   Age Joined_Date  Total_Posts  Reputation Language
0        1     bogdan_s  18.0  2032-01-01          150         500   French
1        2   jane_smith  35.0  2032-02-15          230         720   French
2        3      alex123  25.0  2032-04-25           80         200   French
3        4        bob56  38.0  2032-06-21          420         940   French
4        5  mark_wilson   NaN  2032-09-15          310         500   French

In [158]:
import numpy as np

df['Active'] = np.array([True, False, False, True, True])
df

,User_ID,Username,Age,Joined_Date,Total_Posts,Reputation,Language,Active
0,1,bogdan_s,18.0,2032-01-01,150,500,French,True
1,2,jane_smith,35.0,2032-02-15,230,720,French,False
2,3,alex123,25.0,2032-04-25,80,200,French,False
3,4,bob56,38.0,2032-06-21,420,940,French,True
4,5,mark_wilson,NaN,2032-09-15,310,500,French,True

In [159]:
df2 = pd.DataFrame({
    'Total_Comments' : [70, 30, 45, 55, 80]
})
df2

   Total_Comments
0              70
1              30
2              45
3              55
4              80

In [163]:
df = pd.concat([df, df2], axis=1)
df

,User_ID,Username,Age,Joined_Date,Total_Posts,Reputation,Language,Active,Total_Comments
0,1,bogdan_s,18.0,2032-01-01,150,500,French,True,70
1,2,jane_smith,35.0,2032-02-15,230,720,French,False,30
2,3,alex123,25.0,2032-04-25,80,200,French,False,45
3,4,bob56,38.0,2032-06-21,420,940,French,True,55
4,5,mark_wilson,NaN,2032-09-15,310,500,French,True,80

In [164]:
df.drop(['Language'], axis=1)

,User_ID,Username,Age,Joined_Date,Total_Posts,Reputation,Active,Total_Comments
0,1,bogdan_s,18.0,2032-01-01,150,500,True,70
1,2,jane_smith,35.0,2032-02-15,230,720,False,30
2,3,alex123,25.0,2032-04-25,80,200,False,45
3,4,bob56,38.0,2032-06-21,420,940,True,55
4,5,mark_wilson,NaN,2032-09-15,310,500,True,80

In [165]:
df.drop([2, 3])

,User_ID,Username,Age,Joined_Date,Total_Posts,Reputation,Language,Active,Total_Comments
0,1,bogdan_s,18.0,2032-01-01,150,500,French,True,70
1,2,jane_smith,35.0,2032-02-15,230,720,French,False,30
4,5,mark_wilson,NaN,2032-09-15,310,500,French,True,80

In [166]:
df

,User_ID,Username,Age,Joined_Date,Total_Posts,Reputation,Language,Active,Total_Comments
0,1,bogdan_s,18.0,2032-01-01,150,500,French,True,70
1,2,jane_smith,35.0,2032-02-15,230,720,French,False,30
2,3,alex123,25.0,2032-04-25,80,200,French,False,45
3,4,bob56,38.0,2032-06-21,420,940,French,True,55
4,5,mark_wilson,NaN,2032-09-15,310,500,French,True,80